## 1

- 返回一个函数, C 根本写不出来.

```lisp
; Lisp
(defun addn (n)
  #'(lambda (x)
      (+ x n)))
```

> 你会感到在 C++ 编程是窒碍难行的，就像有经验的 C++ 程序员用 Basic 编程会感到窒息一样

## 2

### 2.1 form

```lisp
(+ 1 2) ; an s-expression
```

grouped `s-expressions` are called "forms"

#### function 作为对象

`'` 作为 quote 的缩写，也可以用 `#'` 作为 `function` 的缩写:

```sh
> (function +)
#<Compiled-Function + 17BA4E>

> (apply #'+ '(1 2 3))
6
```

### 2.2 evaluate

在 Lisp 里, `+`是函数，然而如`(+ 2 3)`的表达式，是`函数调用`

- 但不是所有的 Common Lisp 操作符都是函数

`quote`有自己的求值规则:

```lisp
> (quote (+ 3 5))
(+ 3 5)
```

### 2.3 Data

- lisp 有两个通常其他语言找不到的数据类型, `symbol` 和 `list`

`list`函数用于创建`lists`(列表)

```lisp
> 'Artichoke
ARTICHOKE     ; symbol
```

> 我们现在来到领悟 Lisp 最卓越特性的地方之一。Lisp 的程序是用列表来表示的。

```lisp
> (list '(+ 2 1) (+ 2 1))
((+ 2 1) 3)
```

这里第一个实参被引用了，所以产生一个列表。第二个实参没有被引用，视为函数调用，经求值后得到一个数字。

- `()`and `nil` 都是空 list

`(let a 'a)` 和`(let ((a 'a)) )`区别?
