### primitives
- Number (Int, Float)
- String
- Char
- Bool

### Function
- anonymouse Functions

  ```elm
  \n -> n / 2
  <function> : Float -> Float
  (\n -> n / 2) 128
  64 : Float
  ```
  >(\n -> n / 2) 128, it is important that we put parentheses around the anonymous function. After the arrow, Elm is just going to keep reading code as long as it can. The parentheses put bounds on this, indicating where the function body ends.
  https://guide.elm-lang.org/types/reading_types.html

### Named Functions
- Named Function shorthand style:
  ```elm
  > half n = n / 2
  <function> : Float -> Float

  > half = \n -> n / 2
  <function> : Float -> Float
  ```
- list the arguments of the functon between backslash and arrow
- on the right of the arrow ,to say what to do with the arguments
- all of following named styles are equivalent:
  ```elm
  > divide x y = x / y
  <function> : Float -> Float -> Float

  > divide x = \y -> x / y
  <function> : Float -> Float -> Float

  > divide = \x -> (\y -> x / y)
  <function> : Float -> Float -> Float
  ```
- evaluate an expression like `divide 3 2` what exactlt happened eg:
  ```elm
  divide 3 2
  (divide 3) 2                 -- Step 1 - Add the implicit parentheses
  ((\x -> (\y -> x / y)) 3) 2  -- Step 2 - Expand `divide`
  (\y -> 3 / y) 2              -- Step 3 - Replace x with 3
  3 / 2                        -- Step 4 - Replace y with 2
  1.5                          -- Step 5 - Do the math
  ```
